In [1]:
import pandas as pd

In [7]:
star_list = [["Taylor Swift", "December 13, 1989", "Singer-songwriter"], ["Aaron Sorkin", "June 9, 1961", "Screenwriter"], ["Harry Potter", "July 31, 1980", "Wizard"], ["Ji-Sung Park", "February 25, 1981", "Footballer"]]

In [10]:
df = pd.DataFrame(star_list, columns=["name", "birthday", "occupation"])
df

           name           birthday         occupation
0  Taylor Swift  December 13, 1989  Singer-songwriter
1  Aaron Sorkin       June 9, 1961       Screenwriter
2  Harry Potter      July 31, 1980             Wizard
3  Ji-Sung Park  February 25, 1981         Footballer

In [11]:
print(df.dtypes)

name          object
birthday      object
occupation    object
dtype: object